; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v4)
             (pred_1 ?v12 ?v13)
             (pred_12 ?v6 ?v13)
             (pred_10 ?v2 ?v6 )
	     (pred_3 ?v6)
             (pred_4 ?v3)
             (pred_7 ?v12)
             (pred_6 ?v13)
             (pred_5 ?v6)
             (pred_9 ?v12)
             (pred_8 ?v6)
             (pred_2 ))



(:action op_1
:parameters (?v10 ?v8 ?v1 ?v9)
:precondition (and (pred_4 ?v10) (pred_4 ?v8) (pred_7 ?v1) (pred_6 ?v9)
          (pred_11 ?v10 ?v8) (pred_1 ?v1 ?v9)
                   (pred_12 ?v8 ?v9) (pred_3 ?v10) 
                   (pred_5 ?v8) (pred_9 ?v1))
:effect (and  (pred_8 ?v8) (not (pred_5 ?v8))))


(:action op_4
:parameters (?v10 ?v7)
:precondition (and (pred_4 ?v10) (pred_4 ?v7)
               (pred_3 ?v10) (pred_11 ?v10 ?v7) (pred_8 ?v7))
:effect (and (pred_3 ?v7) (not (pred_3 ?v10))))

(:action op_3
:parameters (?v10 ?v1)
:precondition (and (pred_4 ?v10) (pred_7 ?v1) 
                  (pred_3 ?v10) (pred_10 ?v1 ?v10) (pred_2 ))
:effect (and (pred_9 ?v1)
   (not (pred_10 ?v1 ?v10)) (not (pred_2 ))))


(:action op_2
:parameters (?v10 ?v5 ?v11)
:precondition (and (pred_4 ?v10) (pred_7 ?v5) (pred_7 ?v11)
                  (pred_3 ?v10) (pred_9 ?v11) (pred_10 ?v5 ?v10))
:effect (and (pred_9 ?v5) (pred_10 ?v11 ?v10)
        (not (pred_9 ?v11)) (not (pred_10 ?v5 ?v10))))

(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_4 ?v10) (pred_7 ?v1) 
                  (pred_3 ?v10) (pred_9 ?v1))
:effect (and (pred_2 ) (pred_10 ?v1 ?v10) (not (pred_9 ?v1)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_04 obj_28 obj_08 obj_01 obj_12 obj_17 obj_11 obj_14 obj_29 obj_16 obj_20 obj_06 obj_22 obj_24 obj_23 obj_27 obj_30 obj_21 obj_13 obj_10 obj_25 obj_19 obj_31 obj_02
    obj_26 obj_09 obj_18
    obj_03 obj_05 obj_07
    )

    (:init
       (pred_2)

       (pred_4 obj_15)
       (pred_4 obj_04)
       (pred_4 obj_28)
       (pred_4 obj_08)
       (pred_4 obj_01)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_14)
       (pred_4 obj_29)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_22)
       (pred_4 obj_24)
       (pred_4 obj_23)
       (pred_4 obj_27)
       (pred_4 obj_30)
       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_25)
       (pred_4 obj_19)
       (pred_4 obj_31)
       (pred_4 obj_02)
       (pred_6 obj_26)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_7 obj_07)

       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_28)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_28 obj_11)
       (pred_11 obj_28 obj_08)
       (pred_11 obj_28 obj_04)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_11 obj_28)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_14 obj_22)
       (pred_11 obj_14 obj_29)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_29 obj_24)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_29 obj_14)
       (pred_11 obj_16 obj_23)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_06 obj_22)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_22 obj_24)
       (pred_11 obj_22 obj_14)
       (pred_11 obj_22 obj_06)
       (pred_11 obj_24 obj_13)
       (pred_11 obj_24 obj_29)
       (pred_11 obj_24 obj_22)
       (pred_11 obj_23 obj_10)
       (pred_11 obj_23 obj_27)
       (pred_11 obj_23 obj_16)
       (pred_11 obj_27 obj_25)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_27 obj_23)
       (pred_11 obj_30 obj_19)
       (pred_11 obj_30 obj_21)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_30 obj_27)
       (pred_11 obj_21 obj_31)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_30)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_24)
       (pred_11 obj_13 obj_21)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_23)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_25 obj_27)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_19 obj_31)
       (pred_11 obj_19 obj_30)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_31 obj_02)
       (pred_11 obj_31 obj_21)
       (pred_11 obj_31 obj_19)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_02 obj_31)
       (pred_5 obj_28)
       (pred_5 obj_21)
       (pred_5 obj_08)
       (pred_12  obj_28 obj_26)
       (pred_12  obj_21 obj_09)
       (pred_12  obj_08 obj_18)
       (pred_8 obj_15)
       (pred_8 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_12)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_29)
       (pred_8 obj_16)
       (pred_8 obj_20)
       (pred_8 obj_06)
       (pred_8 obj_22)
       (pred_8 obj_24)
       (pred_8 obj_23)
       (pred_8 obj_27)
       (pred_8 obj_30)
       (pred_8 obj_13)
       (pred_8 obj_10)
       (pred_8 obj_25)
       (pred_8 obj_19)
       (pred_8 obj_31)
       (pred_8 obj_02)

       (pred_1  obj_03 obj_26)
       (pred_1  obj_05 obj_09)
       (pred_1  obj_07 obj_18)
       (pred_10 obj_03 obj_29)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_07 obj_23)
       (pred_3 obj_17)
    )

    (:goal (and
       (pred_10 obj_07 obj_01)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_4 obj_17 obj_20)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_20)
   goals met: 0 of 1
2. (op_4 obj_20 obj_27)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_27)
   goals met: 0 of 1
3. (op_4 obj_27 obj_23)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_23)
   goals met: 0 of 1
4. (op_3 obj_23 obj_07)
   deleted: (pred_10 obj_07 obj_23) (pred_2)
   added: (pred_9 obj_07)
   goals met: 0 of 1
5. (op_4 obj_23 obj_27)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_27)
   goals met: 0 of 1
6. (op_4 obj_27 obj_20)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_20)
   goals met: 0 of 1
7. (op_4 obj_20 obj_17)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_17)
   goals met: 0 of 1
8. (op_4 obj_17 obj_11)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_11)
   goals met: 0 of 1
9. (op_4 obj_11 obj_14)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_14)
   goals met: 0 of 1
10. (op_4 obj_14 obj_29)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_29)
   goals met: 0 of 1
11. (op_4 obj_29 obj_01)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_01)
   goals met: 0 of 1
12. (op_5 obj_01 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_2) (pred_10 obj_07 obj_01)
   goals met: 1 of 1
